# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\chuck.erhardt\Documents\PSoC Creator\W5100_Example1\W5100_Exampl 1-PSoC_Pioneer.cydsn\W5100_Exampl 1-PSoC_Pioneer.cyprj
# Date: Fri, 27 Jun 2014 20:33:29 GMT
#set_units -time ns
create_clock -name {SPI_SCBCLK(FFB)} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {SPI_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 2 3} [list]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]


# Component constraints for C:\Users\chuck.erhardt\Documents\PSoC Creator\W5100_Example1\W5100_Exampl 1-PSoC_Pioneer.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\chuck.erhardt\Documents\PSoC Creator\W5100_Example1\W5100_Exampl 1-PSoC_Pioneer.cydsn\W5100_Exampl 1-PSoC_Pioneer.cyprj
# Date: Fri, 27 Jun 2014 20:33:25 GMT
